   var fakeData={id:3,"children":[{"text":"101室","id":419101,"level":3},{"text":"102室","id":419102,"level":3},{"text":"103室","id":419103,"level":3},{"text":"104室","id":419104,"level":3},{"text":"105室","id":419105,"level":3},{"text":"106室","id":419106,"level":3},{"text":"107室","id":419107,"level":3},{"text":"108室","id":419108,"level":3},{"text":"109室","id":419109,"level":3},{"text":"110室","id":419110,"level":3},{"text":"111室","id":419111,"level":3},{"text":"112室","id":419112,"level":3},{"text":"113室","id":419113,"level":3},{"text":"114室","id":419114,"level":3},{"text":"115室","id":419115,"level":3},{"text":"116室","id":419116,"level":3},{"text":"117室","id":419117,"level":3},{"text":"118室","id":419118,"level":3},{"text":"119室","id":419119,"level":3},{"text":"120室","id":419120,"level":3},{"text":"121室","id":419121,"level":3},{"text":"122室","id":419122,"level":3},{"text":"123室","id":419123,"level":3},{"text":"124室","id":419124,"level":3},{"text":"125室","id":419125,"level":3},{"text":"126室","id":419126,"level":3}]};
    var labels = {
      0:'学区:'
      ,1:'楼宇:'
      ,2:'楼层:'
      ,3:'房间:'
    };
  var studentPathPoints = [{
  position: [12189347.9,3519971.95]
  ,title:'11111'
},
{
  position: [12189224.29,3519988.72]
  ,title:'2222'
},
{
  position: [12189377.39,3520087.67]
  ,title:'3333'
},
{
  position: [12189273.74,3520113.38]
  ,title:'4444'
},
{
  position: [12189226.94,3520008.69]
  ,title:'5555'
}
];
var schoolArea=[
  {
    position:[12189106.89, 3520194.76]//1
  ,title:"一区"
  
  },
    {
    position:[12189234.71,3520636.12 ]//16
  ,title:"二区"
  
  },
    {
    position:[12189494.15,  3520848.43  ] //食堂
  ,title:"三区"
  
  },
    {
    position:[12189528.9, 3520204.6  ]//艺术学院
  ,title:"四区"
  }
  
];
myPoints=[
  {position:[12189023.95,  3520110.8 ]
  ,title:"学生宿舍1栋"
  }
  // {position:[12189039.69, 3520142.12  ]
  // ,title:"学生宿舍2栋"
  // },
  // {position:[12189049.36, 3520177.64]
  // ,title:"学生宿舍3栋"
  // },
  
  // {position:[ 12189067.9, 3520213.85]
  // ,title:"学生宿舍4栋"
  // },{
  //   position:[ 12189082.31, 3520248.93]
  //   ,title:"学生宿舍5栋"
  // }
  // ,{
  //   position:[ 12189102.05, 3520290.67 ]
  //   ,title:"学生宿舍6栋"
  // }
  
  
  // ,{
  //   position:[ 12189191.37, 3520420.7]
  //   ,title:"学生宿舍10栋"
  // }
  //   ,{
  //   position:[ 12189192.54, 3520458.05]
  //   ,title:"学生宿舍11栋"
  // }
  // ,{position:[12189197.23,3520499.56],title:"学生宿舍12栋"
  // ,status:'emergency'
  // }
  // ,{position:[12189198.65,3520534.26],title:"学生宿舍13栋"}
  // ,{position:[12189197.88,3520571.16],title:"学生宿舍14栋"}
  // ,{position:[12189195.41,3520606.4],title:"学生宿舍15栋"}
  // ,{position:[12189189.17,3520641.58],title:"学生宿舍16栋"}
  // ,{position:[12189187.8,3520678.62],title:"学生宿舍17栋"}
  // ,{position:[12189178.53,3520713.01],title:"学生宿舍B1栋"}
  // ,{position:[12189179.58,3520752.41],title:"学生宿舍B2栋"
  // ,status:'emergency'
  // }
  // ,{position:[12189182.68,3520797.44],title:"学生宿舍B3栋"}
  // ,{position:[12189366.92,3520952.18],title:"科技学院学生宿舍4栋"}
  // ,{position:[12189398.39,3520928.62],title:"科技学院学生宿舍5栋"}
  // ,{position:[12189429.26,3520905.21],title:"科技学院学生宿舍6栋"}
  // ,{position:[12189453.68,3520884.91],title:"科技学院学生宿舍7栋"}
  // ,
  // {position:[12189535.22,3520819.05],title:"科技学院学生宿舍8栋"}
  // ,
  // {position:[12189563.42,3520793.03],title:"科技学院学生宿舍9栋"}
  // ,{position:[12189595.98,3520772.71],title:"科技学院学生宿舍10栋"}
  //,{position:[12189634.37,3520755.19],title:"科技学院学生宿舍11栋"}
];